# CouldNotChangeTypeOfAssembly Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..AssemblyFailures..::..CouldNotChangeTypeOfAssembly Property
BuiltInFailures..::..AssemblyFailures Class See Also
---
Assembly cannot be changed to selected type.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId CouldNotChangeTypeOfAssembly { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property CouldNotChangeTypeOfAssembly As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ CouldNotChangeTypeOfAssembly {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..AssemblyFailures Class
Autodesk.Revit.DB Namespace